# Analytical Element Is Valid Transform Method

Source: https://www.revitapidocs.com/2026/4c5b9a26-118a-d022-e2ff-bf9a2c4a9c3a.htm

---

| Analytical Element Is Valid Transform Method |
| --- |

Checks whether the value set for Local Coordinate System is valid for an Analytical Element.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsValidTransform(
	Transform trf
)
```

```
Public Function IsValidTransform (
	trf As Transform
) As Boolean
```

```
public:
bool IsValidTransform(
	Transform^ trf
)
```

```
member IsValidTransform :
        trf : Transform -> bool
```

#### Parameters

trf Transform
:   The value set to be verified.

#### Return Value

Boolean Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks Origin should be equal with Origin from GetTransform Z axis should be parallel with Analytical Element's plane's normal.
 X and Y axis should be in Analytical Element's plane.
 For non\-planar elements the X or Y axis should be tangent at transform origin. See Also

#### Reference

AnalyticalElement Class Autodesk.Revit.DB.Structure Namespace